# Pipe Fitting And Accessory Pressure Drop Item End Connector Index Property

Source: https://www.revitapidocs.com/2026/aac67e76-0a42-1d5a-708b-232266e83084.htm

---

| Pipe Fitting And Accessory Pressure Drop Item End Connector Index Property |
| --- |

The index of the end conector of the flow path.
**Namespace:** Autodesk.Revit.DB.Plumbing
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int EndConnectorIndex { get; }
```

```
Public ReadOnly Property EndConnectorIndex As Integer
	Get
```

```
public:
property int EndConnectorIndex {
	int get ();
}
```

```
member EndConnectorIndex : int with get
```

#### Property Value

Int32 See Also

#### Reference

PipeFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Plumbing Namespace